/*******************************************************************************
;    Project:       Open Vehicle Monitor System
;    Date:          24 Nov 2012
;
;    Changes:
;    1.0  Initial release
;
;    1.1  2 Nov 2012 (Michael Balzer):
;           - Basic Twizy integration
;
;    1.2  9 Nov 2012 (Michael Balzer):
;           - CAN lockups fixed
;           - CAN data validation
;           - Charge+Key status from CAN 0x597 => reliable charge stop detection
;           - Range updates while charging
;           - Odometer
;           - Suppress SOC alert until CAN status valid
;
;    1.3  11 Nov 2012 (Michael Balzer):
;           - km to integer miles conversion with smaller error on re-conversion
;           - providing car_linevoltage (fix 230 V) & car_chargecurrent (fix 10 A)
;           - providing car VIN to be ready for auto provisioning
;           - FEATURE 10 >0: sufficient SOC charge monitor (percent)
;           - FEATURE 11 >0: sufficient range charge monitor (km/mi)
;           - FEATURE 12 >0: individual maximum ideal range (km/mi)
;           - chargestate=2 "topping off" when sufficiently charged or 97% SOC
;           - min SOC warning now triggers charge alert
;
;    1.4  16 Nov 2012 (Michael Balzer):
;           - Crash reset hardening w/o eating up EEPROM space by using SRAM
;           - Interrupt optimization
;
;    1.5  18 Nov 2012 (Michael Balzer):
;           - SMS cmd "STAT": moved specific output to vehicle module

    - CAN control bits to disable emergency reset, kickdown & autopower
    - Fix: motor & PEM temperatures fixed, charger temperature added


; Permission is hereby granted, free of charge, to any person obtaining a copy
; of this software and associated documentation files (the "Software"), to deal
; in the Software without restriction, including without limitation the rights
; to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
; copies of the Software, and to permit persons to whom the Software is
; furnished to do so, subject to the following conditions:
;
; The above copyright notice and this permission notice shall be included in
; all copies or substantial portions of the Software.
;
; THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
; IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
; FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
; AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
; LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
; OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
; THE SOFTWARE.
 */

#include <stdlib.h>
#include <delays.h>
#include <string.h>
#include <stdio.h>
#include <math.h>
#include "ovms.h"
#include "params.h"
#include "led.h"
#include "utils.h"
#include "net_sms.h"
#include "net_msg.h"
#include "crypt_base64.h"


/***************************************************************
 * Twizy mandatory compile switches:
 * 
 *  OVMS_CAR_RENAULTTWIZY -- enable this module
 *  OVMS_INTERNALGPS -- enable SIM908 GPS
 *  OVMS_NO_SMSTIME -- disable automatic SMS time stamps
 * 
 * Twizy optional compile switches:
 * 
 *  OVMS_TWIZY_DEBUG -- enable DEBUG cmd
 *  OVMS_CANSIM -- include CAN simulation data (needs DEBUG cmd)
 *  OVMS_TWIZY_BATTMON -- enable battery pack/cell monitoring
 *  OVMS_TWIZY_CFG -- enable SEVCON configuration
 *  OVMS_TWIZY_CFG_BRAKELIGHT -- enable CFG BRAKELIGHT
 *  OVMS_TWIZY_STACKDEBUG -- enable stack depth debugging
 * 
 * Compile switches to exclude unused framework features:
 * 
 *  OVMS_NO_CHARGECONTROL -- excludes CHARGEMODE, CHARGESTART, CHARGESTOP, COOLDOWN
 *  OVMS_NO_CTP -- excludes framework charge time prediction
 *  OVMS_NO_VEHICLE_ALERTS -- excludes cabin & trunk alerts
 *  OVMS_NO_CRASHDEBUG -- excludes *-OVM-DebugCrash record generation
 * 
 */



/***************************************************************
 * Twizy definitions
 */


// Twizy specific features:

#define FEATURE_KICKDOWN_THRESHOLD  0x01 // Kickdown threshold (pedal change)
#define FEATURE_KICKDOWN_COMPZERO   0x02 // Kickdown pedal compensation zero point

#define FEATURE_SUFFSOC             0x0A // Sufficient SOC [%]
#define FEATURE_SUFFRANGE           0x0B // Sufficient range [Mi/km]
#define FEATURE_MAXRANGE            0x0C // Maximum ideal range [Mi/km]
#define FEATURE_CAPACITY            0x0D // Battery capacity [1/100 %]

// Twizy specific FEATURE_CANWRITE bitmap:
typedef struct {
  unsigned EnableWrite:1;       // 0x01
  unsigned DisableReset:1;      // 0x02
  unsigned DisableKickdown:1;   // 0x04
  unsigned DisableAutoPower:1;  // 0x08
  unsigned :1;                  // 0x10
  unsigned :1;                  // 0x20
  unsigned :1;                  // 0x40
  unsigned :1;                  // 0x80
} sys_canbits_t;
#define sys_can (*((sys_canbits_t*)&sys_features[FEATURE_CANWRITE]))



// Twizy specific params:
// (Note: these collide with ACC params, but ACC module will not be used for Twizy)

#define PARAM_PROFILE               0x0F // current cfg profile nr (0..3)
#define PARAM_PROFILE_S             0x10 // custom profiles base
#define PARAM_PROFILE1              0x10 // custom profile #1 (binary, 2 slots)
#define PARAM_PROFILE2              0x12 // custom profile #2 (binary, 2 slots)
#define PARAM_PROFILE3              0x14 // custom profile #3 (binary, 2 slots)


// Twizy specific commands:
#define CMD_Debug                   200 // ()
#define CMD_QueryRange              201 // ()
#define CMD_SetRange                202 // (maxrange)
#define CMD_QueryChargeAlerts       203 // ()
#define CMD_SetChargeAlerts         204 // (range, soc)
#define CMD_BatteryAlert            205 // ()
#define CMD_BatteryStatus           206 // ()
